app/Controllers/Auth/Login.php

SELECT `user`.*, `role`.`nama` as `role`
FROM `user`
JOIN `role` ON `role`.`id_role` = `user`.`id_role`
WHERE `user`.`no_wa` = '089888777656'
 LIMIT 1
UPDATE `user` SET `is_lock` = 0, `login_attempt` = 0, `last_login_at` = NULL
WHERE `user`.`id_user` IN ('1')
UPDATE `user` SET `login_attempt` = 1, `last_login_at` = '2024-10-09 07:24:34'
WHERE `user`.`id_user` IN ('1')
---
    public function store() {
        if ( !$this->validate($this->rules, $this->validationMessage) ) {
            return $this->response->setJSON([
                'status' => false,
                'errors' => \Config\Services::validation()->getErrors()
            ]);
        }

        $user = $this->user->select('user.*, role.nama as role')->join('role', 'role.id_role = user.id_role')->where('user.no_wa', $this->request->getVar('no_wa'))->first();

        if ( $user ) {
            $last_login = date('Y-m-d H:i:s', strtotime('+30 minutes', strtotime($user['last_login_at'])));

            if ( boolval($user['is_lock']) && date('Y-m-d H:i:s') >= $last_login ) {
                $this->user->update($user['id_user'], [
                    'is_lock' => false,
                    'login_attempt' => 0,
                    'last_login_at' => null
                ]);
            }

            if ( !boolval($user['is_lock']) ) {
                $this->user->update($user['id_user'], [
                    'login_attempt' => intval($user['login_attempt']) + 1,
                    'last_login_at' => date('Y-m-d H:i:s')
                ]);