app/Controllers/Admin/Edukasi.php

    public function update($id)
     {
         $edukasi = $this->edukasiModel->find($id);
             // Validasi form
             log_message('debug', 'Request adalah POST');
             $validation = $this->validate([
                 'judul_yt'   => 'required',
                 'deskripsi'  => 'required',
                 'link_yt'    => 'required'
             ]);

              // Update data ke database
              $this->edukasiModel->update($id, [
                'judul_yt'  => $this->request->getPost('judul_yt'),
                'deskripsi' => $this->request->getPost('deskripsi'),
                'link_yt'   => $this->request->getPost('link_yt'),
            ]);
---
UPDATE `edukasi` SET `judul_yt` = 'Rahasia Sukses Ternak Kambing', `deskripsi` = 'Intip cerita sukses ternak kambing dari 7 ekor hingga 200 ekor', `link_yt` = 'https://www.youtube.com/watch?v=QUhGye8LAXg'
WHERE `edukasi`.`id_edukasi` IN ('1')