app/Controllers/Admin/KotakSaran.php

    public function index()
    {
        // Inisialisasi model
        $kotakSaranModel = new KotakSaranModel();

        // Ambil data dari tabel kotak_saran
        $dataSaran = $kotakSaranModel->findAll();
---
SELECT *
FROM `kotak_saran`