app/Models/Admin/EdukasiModel.php

SELECT *
FROM `edukasi`
---
    public function getEdukasi()
    {
        return $this->findAll(); // Menggunakan metode findAll() dari Model