app/Models/Admin/ObatModel.php

    public function getObat()
    {
        return $this->findAll(); // Menggunakan metode findAll() dari Model
---
SELECT *
FROM `obat`