app/Models/Admin/PetugasModel.php

SELECT *
FROM `petugas`
---
    public function getPetugas()
    {
        return $this->findAll(); // Menggunakan metode findAll() dari Model